<a href="https://colab.research.google.com/github/WahlerP/csfundamentals-hsg/blob/master/Data_Wrangling_with_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **DS - Data Wrangling with Pandas**

In the follwing notebook you will get familiar with the pandas library. pandas is a catch-all Python library that serves as the go-to resource for doing data analysis and manipulation. Any kind of data processing, analyzing, filtering, and aggregating is done with pandas. Pandas can be used for just about any process where you're trying to gain insight from data using code.
<br>
<br>
We will have a look at DataFrames, probably the most popular tool of the pandas library. A data frame is a table or a two-dimensional array-like structure in which each column contains values of one variable and each row contains one set of values from each column. As pandas allows us to do a lot of stuff with this table, you can imagine a dataframe as a sort of excel spreadsheet on steroids.

In [0]:
import pandas as pd

# Example - Boston Housing Prices

Before going in too much detail, let's have a look at how such a DataFrame may look like. In the following we will load a DataFrame that contains several datapoints on housing data in the Boston area.

In [0]:
from sklearn import datasets

boston_dataset = datasets.load_boston()

In [52]:
boston = pd.DataFrame(boston_dataset.data, columns=boston_dataset.feature_names)
boston["MEDV"] = boston_dataset.target
boston = boston.set_index("MEDV")
boston

         CRIM    ZN  INDUS  CHAS    NOX  ...  RAD    TAX  PTRATIO       B  LSTAT
MEDV                                     ...
24.0  0.00632  18.0   2.31   0.0  0.538  ...  1.0  296.0     15.3  396.90   4.98
21.6  0.02731   0.0   7.07   0.0  0.469  ...  2.0  242.0     17.8  396.90   9.14
34.7  0.02729   0.0   7.07   0.0  0.469  ...  2.0  242.0     17.8  392.83   4.03
33.4  0.03237   0.0   2.18   0.0  0.458  ...  3.0  222.0     18.7  394.63   2.94
36.2  0.06905   0.0   2.18   0.0  0.458  ...  3.0  222.0     18.7  396.90   5.33
...       ...   ...    ...   ...    ...  ...  ...    ...      ...     ...    ...
22.4  0.06263   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  391.99   9.67
20.6  0.04527   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   9.08
23.9  0.06076   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   5.64
22.0  0.10959   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  393.45   6.48
11.9  0.04741   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   7.88

[506 rows x 13 columns]

Now we have a table with 506 rows and 13 columns. Typing in `boston_dataset.DESCR` we can see that the MEDV column describes the value of a specific house whereas the other columns describe further attributes that are connected with the house in a specific row (e.g. PTRATIO = pupil-teacher ratio by town).

In [34]:
boston_dataset.DESCR

".. _boston_dataset:\n\nBoston house prices dataset\n---------------------------\n\n**Data Set Characteristics:**  \n\n    :Number of Instances: 506 \n\n    :Number of Attributes: 13 numeric/categorical predictive. Median Value (attribute 14) is usually the target.\n\n    :Attribute Information (in order):\n        - CRIM     per capita crime rate by town\n        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.\n        - INDUS    proportion of non-retail business acres per town\n        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)\n        - NOX      nitric oxides concentration (parts per 10 million)\n        - RM       average number of rooms per dwelling\n        - AGE      proportion of owner-occupied units built prior to 1940\n        - DIS      weighted distances to five Boston employment centres\n        - RAD      index of accessibility to radial highways\n        - TAX      full-value property-tax rate per $10,000\n        - PTRATIO  pupil-teacher ratio by town\n        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town\n        - LSTAT    % lower status of the population\n        - MEDV     Median value of owner-occupied homes in $1000's\n\n    :Missing Attribute Values: None\n\n    :Creator: Harrison, D. and Rubinfeld, D.L.\n\nThis is a copy of UCI ML housing dataset.\nhttps://archive.ics.uci.edu/ml/machine-learning-databases/housing/\n\n\nThis dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.\n\nThe Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic\nprices and the demand for clean air', J. Environ. Economics & Management,\nvol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics\n...', Wiley, 1980.   N.B. Various transformations are used in the table on\npages 244-261 of the latter.\n\nThe Boston house-price data has been used in many machine learning papers that address regression\nproblems.   \n     \n.. topic:: References\n\n   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.\n   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.\n"

We can now use this dataset, for example, to write an algorithm that predicts the value of a new house given some attributes.

# Pandas Series

In pandas, 1-D arrays are referred to a series. You can think of it a cross between a list and a dictionary. The items are all stored in an order and there's labels with which you can retrieve them. 

Every single column of the boston dataset above is, for example, a series object. Therefore, combining many individual Series objects creates a DataFrame. That's why it's a good idea to learn about the Series before moving on to the DataFrame.


 A series is created through the `pd.Series` constructor, which has a lot of optional arguments. Let's explore it a bit more by typing in `pd.Series?`

In [0]:
pd.Series?

The most common argument is data, which specifies the elements of the series. Let's convert the list `grades = [6, 5, 4.5, 5.5] `to a Series object.

In [57]:
grades = [6, 5, 4.5, 5.5] 
s = pd.Series(data=grades)
s

0    6.0
1    5.0
2    4.5
3    5.5
dtype: float64

In [58]:
# Of course, we can also fill a Series with strings
a= pd.Series(data=["Hello", "World", "Ok", "Bye"])
a

0    Hello
1    World
2       Ok
3      Bye
dtype: object

The numbers to the left of the Series is the index of the object and specifies the row.

If we want our index to be more descriptive, we can also create a Series using a dictionary.

In [60]:
sports = {'Football': 'Germany',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(data=sports) 
s

Football         Germany
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

We can also  separate the index creation from the data by passing in the index as a list explicitly to the series.

In [61]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

### Querying a Series

A Pandas Series can be queried, either by the index position or the index label. As we saw, if you don't give an index to the series, the position and the label are effectively the same values. To query by numeric location, starting at zero, use the `iloc` attribute. To query by the index label, you can use the `loc` attribute.

In [62]:
sports = {'Football': 'Germany',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Football         Germany
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

Access a row by integer index

In [63]:
s.iloc[3]

'South Korea'

Access a row by label

In [64]:
s.loc['Golf']

'Scotland'

Keep in mind that `iloc` and `loc` are not methods, they are attributes. So you don't use parentheses to query them, but square brackets instead, which we'll call the indexing operator. Though in Python, this calls get and set an item methods depending on the context of its use.

if you pass in an integer parameter, the operator will behave as if you want it to query via the `iloc` attribute.

In [65]:
s[3]

'South Korea'

If you pass in an object, it will query as if you wanted to use the label based `loc` attribute.

In [66]:
s['Golf']

'Scotland'

Here's an example using some new sports data, where countries are indexed by integer.

In [67]:
sports = {99: 'Germany',
          100: 'Scotland',
          101: 'Japan',
          102: 'South Korea'}
s = pd.Series(sports)
s

99         Germany
100       Scotland
101          Japan
102    South Korea
dtype: object

If we try and call `s[0]`, we get a key error

In [68]:
s[0] # we get a key error, because there's no item in the sports list with an index of zero.

KeyError: ignored

In [69]:
s.iloc[0] # Instead we have to call iloc explicitly if we want the first item.

'Germany'

In [70]:
s[99] # the first entry has the index of 99

'Germany'

One last note on using the indexing operators to access series data. The `.loc` attribute lets you not only modify data in place, but also add new data as well.

Pandas will automatically change the underlying NumPy types as appropriate.

In [0]:
s = pd.Series([1, 2, 3])
print(s)
s.loc['Animal'] = 'Dog'
print(s)

0    1
1    2
2    3
dtype: int64
0           1
1           2
2           3
Animal    Dog
dtype: object

We end this chapter by showing example where index values are not unique, and this makes a data Series different conceptually, that a relational database might be

Revisiting the issue of countries and their national sports, it turns out that many countries seem to like this game cricket. We go back to our original series on sports. It's possible to create a new series object with multiple entries for cricket, and then use append to bring these together. There are a couple of important considerations when using append. First, Pandas is going to take your series and try to infer the best data types to use. In this example, everything is a string, so there's no problems here.

Second, the append method doesn't actually change the underlying series. It instead returns a new series which is made up of the two appended together.

In [0]:
original_sports = pd.Series({'Football': 'Germany',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})

cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])

all_countries = original_sports.append(cricket_loving_countries)

Printing the original series of values and seeing that they haven't changed.

In [0]:
original_sports

Football         Germany
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

This is actually a significant issue for new Pandas users who are used to objects being changed in place. So watch out for it, not just with append but with other Pandas functions as well.

In [0]:
cricket_loving_countries

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [0]:
all_countries

Football         Germany
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

Finally, we see that when we query the appended series for those who have cricket as their national sport, we don't get a single value, but a series itself.

In [0]:
all_countries.loc['Cricket']

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

# Pandas DataFrames

The DataFrame data structure is the heart of the Panda's library. It's a primary object that you'll be working with in data analysis and cleaning tasks.

The DataFrame is conceptually a **two-dimensional series object**, where there's an index and multiple columns of content, with each column having a label. Think of the DataFrame itself as simply a two-axes labeled array.

## Data Frame creation
You can create a DataFrame in many different ways, some of which you might expect. For instance, you can use a group of series, where each series represents a row of data. Or you could use a group of dictionaries, where each dictionary represents a row of data.

We are going to create three purchase order records as series objects for a sort of fictional store. The index will be the Store names

In [173]:

purchase_1 = pd.Series({'Name': 'Matthias',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Thomas',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Christina',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame(data = [purchase_1, purchase_2, purchase_3])
df

        Name Item Purchased  Cost
0   Matthias       Dog Food  22.5
1     Thomas   Kitty Litter   2.5
2  Christina      Bird Seed   5.0

Similar to the Series object, all rows in the DataFrame have an index, which is the label of that row. By default, the RangeIndex is used, which simply counts up from zero and assigns each row a number. Again, we can also specify a custom index as can be seen below.

In [174]:
df = pd.DataFrame(data = [purchase_1, purchase_2, purchase_3], index=["Store 1", "Store 2", "Store 3"])
df

              Name Item Purchased  Cost
Store 1   Matthias       Dog Food  22.5
Store 2     Thomas   Kitty Litter   2.5
Store 3  Christina      Bird Seed   5.0

In case we have several hundreds or thousands of data entries, it would be infeasible to create a DataFrame manually. Therefore, pandas allows you to import several types of existing data sets. 

You can load a csv file via `pd.read_csv("filename")` or an excel file via `pd.read_excel("filename")`. While this is not further elaborated here, a great tutorial can be found [here](https://www.shanelynn.ie/python-pandas-read_csv-load-data-from-csv-files/).

## Accessing Data
Similar to the series, we can extract data using the `iloc` and `loc` attributes.

### Accessing Rows

Let's take our Store Dataframe and select data associated with Store 2. Againm rows can be accessed by their row index using `.iloc`.

Be aware that index 0 indicates the first element (zero-based indexing).

In [96]:
df.iloc[0]

Name              Matthias
Item Purchased    Dog Food
Cost                  22.5
Name: Store 1, dtype: object

Because the DataFrame is two-dimensional, passing a single value to the `iloc` indexing operator will return a series if there's only one row to return.

Of course we can also use the `.loc` operator to access rows by the name of the label.

In [97]:
df.loc['Store 2']

Name                    Thomas
Item Purchased    Kitty Litter
Cost                       2.5
Name: Store 2, dtype: object

 We can check the data type of the return using the python type function.

In [98]:
type(df.loc['Store 2'])

pandas.core.series.Series

### Accessing Multiple Rows

We can also access multiple rows. Here we just pass a **list** of the desired rows to our `.loc` or `.iloc` operator.

In [100]:
df.loc[["Store 1", "Store 2"]]

             Name Item Purchased  Cost
Store 1  Matthias       Dog Food  22.5
Store 2    Thomas   Kitty Litter   2.5

In [101]:
df.iloc[[0,1]]

             Name Item Purchased  Cost
Store 1  Matthias       Dog Food  22.5
Store 2    Thomas   Kitty Litter   2.5

### Column Selection

What if we just wanted to do access specific columns instead. Let's say we want to get a list of all the costs.

**1. Indexing Operator**

In a Pandas DataFrame, columns always have a name;  therefore we can simply use indexing to access a column

In [0]:
df['Cost']

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

**2. Full slice with Loc**

`.loc` and `.iloc` does row selection and can take two parameters, the row index and a list of column names. It also supports slicing. If we wanted to select all rows, we can use a column operator `:` to indicate a full slice from beginning to end. And then add the column name as the second parameter as a string.

In [104]:
df.loc[:,["Cost"]]

         Cost
Store 1  22.5
Store 2   2.5
Store 3   5.0

In fact, if we wanted to include multiply columns, we could do so in a list. And Pandas will bring back only the columns we have asked for.

In [106]:
a = df.loc[:,['Name', 'Cost']]
a

              Name  Cost
Store 1   Matthias  22.5
Store 2     Thomas   2.5
Store 3  Christina   5.0

This time around, however, we do not get a series object as a return but another DataFrame.

In [107]:
type(a)

pandas.core.frame.DataFrame

### Accessing Rows and Columns

As you may have guessed, `.iloc` and `.loc` lets you access rows and columns objects at the same time. Here simply follow the syntax:

**`df.iloc[[list of rows],[list of columns]]`**

Make sure to not mix iloc and loc.

In [112]:
df.loc[["Store 1", "Store 3"], ["Name"]]

              Name
Store 1   Matthias
Store 3  Christina

In [113]:
df.iloc[[0,2],[0]]

              Name
Store 1   Matthias
Store 3  Christina

## Masking/Selecting

Often, we do want to select certain rows and columns in our dataframe accrording to some conditions. We can filter our dataframe boolean conditions. They check whether a condition is True or False for a certain value and return a Series object.

In [116]:
print(df["Cost"] > 4) # in column cost check which entries are higher than 4

Store 1     True
Store 2    False
Store 3     True
Name: Cost, dtype: bool

The returned Series can be used for Masking. Here we filter columns with boolean conditions and only return those rows for which the condition was True.

The syntax looks as follows:

**`df[df[Column]Boolean Condition]`**

In [120]:
# Return the Rows for which costs are higher than 4
df[df["Cost"]> 4]

              Name Item Purchased  Cost
Store 1   Matthias       Dog Food  22.5
Store 3  Christina      Bird Seed   5.0

## Operations on DataFrames

In many cases, one must do more than just accessing certain rows and columns of a dataframe. Let's look at some further applications of our pandas library.

### Replacing NaN

Often datasets have empty fields due to lack of data or wrong data extraction. These fields are filled with None type values which Pandas automatically converts to a special floating point value designated as NAN, which stands for not a number.

 If we create a list of numbers, integers or floats, and put in the None type, Pandas automatically converts this to a special floating point value designated as NAN, which stands for not a number.

In [0]:
numbers = [1, 2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

Before processing our data, we often want to "clean" it. Here, we can replace all NaN fields with a real number of our choice with `numpy.fillna(number)`.

In [142]:
fd = pd.DataFrame(data={'Company': ['Apple', 'Google', 'Intel', 'AMD', 'Startup'], '% Growth':[4, 2, 4, 8, np.nan]})

fd = (fd.fillna(0))
fd

   Company  % Growth
0    Apple       4.0
1   Google       2.0
2    Intel       4.0
3      AMD       8.0
4  Startup       0.0

### Dropping Data

It's easy to delete data in series and DataFrames, and we can use the drop function to do so. This function takes a single parameter, which is the index or roll label, to drop.

The basic syntax looks as follows:

**`df.drop(label, axis)`**

Axis can either be 0 (=drop rows) or 1 (= drop columns)

In [153]:
df.drop("Store 1")

              Name Item Purchased  Cost
Store 2     Thomas   Kitty Litter   2.5
Store 3  Christina      Bird Seed   5.0

In [166]:
df.drop("Cost", axis=1)

              Name Item Purchased
Store 1   Matthias       Dog Food
Store 2     Thomas   Kitty Litter
Store 3  Christina      Bird Seed

The drop function doesn't change the DataFrame by default. And instead, returns to you a copy of the DataFrame with the given rows removed. 

We can see that our original DataFrame is still intact.

In [167]:
df

              Name Item Purchased  Cost
Store 1   Matthias       Dog Food  22.5
Store 2     Thomas   Kitty Litter   2.5
Store 3  Christina      Bird Seed   5.0

Let's make a copy with the copy method and do a drop on it instead.

In [168]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')
copy_df

              Name Item Purchased  Cost
Store 2     Thomas   Kitty Litter   2.5
Store 3  Christina      Bird Seed   5.0

This is a very typical pattern in Pandas, where in place changes to a DataFrame are only done if need be, usually on changes involving indices.

**So it's important to be aware of.**

In [0]:
copy_df.drop?

 Drop has two interesting optional parameters.

- The first is called in place, and if it's set to true, the DataFrame will be updated in place, instead of a copy being returned.

- The second parameter is the axes, which should be dropped.

    - By default, this value is 0, indicating the row axes.

    - But you could change it to 1 if you want to drop a column.

### Pandas Apply

Using the `.apply(function, axis)` method lets us apply a function along a specified axis of a DataFrame.

In [194]:
numbers = pd.DataFrame({"num 1":[1,2,3,4,5,6], "num 2": [10,20,30,40,50,60]})
numbers

   num 1  num 2
0      1     10
1      2     20
2      3     30
3      4     40
4      5     50
5      6     60

In [195]:
numbers.apply(sum, axis=0)

num 1     21
num 2    210
dtype: int64

In [186]:
#try to understand how the following code snippet works
df["Cost"] = df["Cost"].apply(lambda x: x-2)
df

              Name Item Purchased  Cost
Store 1   Matthias       Dog Food  88.0
Store 2     Thomas   Kitty Litter   8.0
Store 3  Christina      Bird Seed  18.0

### Mean

Use the mean function to calculate the mean of a row or column.

In [196]:
numbers.mean(axis=0)

num 1     3.5
num 2    35.0
dtype: float64

In [197]:
numbers.mean(axis=1)

0     5.5
1    11.0
2    16.5
3    22.0
4    27.5
5    33.0
dtype: float64

### Median

Use the median function to calculate the median of a row or column.

In [198]:
numbers.median(axis=0)

num 1     3.5
num 2    35.0
dtype: float64

In [199]:
numbers.median(axis=1)

0     5.5
1    11.0
2    16.5
3    22.0
4    27.5
5    33.0
dtype: float64

### Ranking a DataFrame

You can rank a DataFrames according to specific values within a column. Let's explore the `rank` function.

In [0]:
df.rank?

We can see that rank has some interesting parameters:


*   **Axis** describes whether we rank rows (0) or columns(1)
*   The **method** parameter specifies rules that apply if certain elements have the same value. It defaults to "average" which means that it takes the average for records that have the same rank.
*   **na_option** specifies what to do with NaN values. Bottom for example, pushes these values to the end of the ranking.
*   with **pct** set to True, we can rank according to the percentile of the values.

In [203]:
# create example dataframe
foo = pd.DataFrame(data={'Company': ['Apple',
'Google', 'Intel', 'AMD', 'Startup'], '% Growth':
[4, 2, 4, 8, np.nan]})
foo

   Company  % Growth
0    Apple       4.0
1   Google       2.0
2    Intel       4.0
3      AMD       8.0
4  Startup       NaN

In [207]:
foo['default'] = foo['% Growth'].rank()
foo['max'] = foo['% Growth'].rank(method='max')
foo['NA_bottom'] = foo['% Growth'].rank(na_option='bottom')
foo['pct'] = foo['% Growth'].rank(pct=True)

foo

   Company  % Growth  default  max  NA_bottom    pct
0    Apple       4.0      2.5  3.0        2.5  0.625
1   Google       2.0      1.0  1.0        1.0  0.250
2    Intel       4.0      2.5  3.0        2.5  0.625
3      AMD       8.0      4.0  4.0        4.0  1.000
4  Startup       NaN      NaN  NaN        5.0    NaN

### Sorting DataFrames

with `pd.sort_values` we can sort our dataframe according to specified parameters. Again, we must be careful to specify the correct axis!

**`df.sort_values(by=[str or list to sort by], axist)`**

In [211]:
foo.sort_values(by= "% Growth", ascending=False)

   Company  % Growth  default  max  NA_bottom    pct
3      AMD       8.0      4.0  4.0        4.0  1.000
0    Apple       4.0      2.5  3.0        2.5  0.625
2    Intel       4.0      2.5  3.0        2.5  0.625
1   Google       2.0      1.0  1.0        1.0  0.250
4  Startup       NaN      NaN  NaN        5.0    NaN

Note, that the index changes according to the rows.

## Altering the Dataframe

Let's explore how we can make "on-the-go" changes to a DataFrame.

In [237]:
df = pd.DataFrame([{'Name': 'Matthias', 'Item Purchased': 'Sponge', 'Cost': 22.50}, 
                  {'Name': 'Thomas', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50}, 
                   {'Name': 'Christina', 'Item Purchased': 'Spoon', 'Cost': 5.00}], 
                  index=['Store 1', 'Store 1', 'Store 2'])
df

              Name Item Purchased  Cost
Store 1   Matthias         Sponge  22.5
Store 1     Thomas   Kitty Litter   2.5
Store 2  Christina          Spoon   5.0

### Adding Columns

You can add new columns. Just define the data you want to have in that column.
Note that it must correspond to the number of rows in your DataFrame!

In [238]:
df['Date'] = ['December 1', 'January 1', 'mid-May']
df

              Name Item Purchased  Cost        Date
Store 1   Matthias         Sponge  22.5  December 1
Store 1     Thomas   Kitty Litter   2.5   January 1
Store 2  Christina          Spoon   5.0     mid-May

### Adding Single Values

You can also create a column and add this with a single value. This is often used to create a placeholder, which will be altered later on.

In [239]:
df["Delivered"] = np.nan
df

              Name Item Purchased  Cost        Date  Delivered
Store 1   Matthias         Sponge  22.5  December 1        NaN
Store 1     Thomas   Kitty Litter   2.5   January 1        NaN
Store 2  Christina          Spoon   5.0     mid-May        NaN

In [240]:
# let's fill the column
df["Delivered"] = [True, True, False]
df

              Name Item Purchased  Cost        Date  Delivered
Store 1   Matthias         Sponge  22.5  December 1       True
Store 1     Thomas   Kitty Litter   2.5   January 1       True
Store 2  Christina          Spoon   5.0     mid-May      False

### Add Series as a Column

Remember that we said earlier that, in essence, a Dataframe consists of several combined Series. Therefore, it should be possible to add an entire Series as a column to a Dataframe.

In [241]:
#create series object

s = pd.Series(["Positive", "Negative"])
s

0    Positive
1    Negative
dtype: object

In [242]:
df["Feedback"] = s
df

              Name Item Purchased  Cost        Date  Delivered Feedback
Store 1   Matthias         Sponge  22.5  December 1       True      NaN
Store 1     Thomas   Kitty Litter   2.5   January 1       True      NaN
Store 2  Christina          Spoon   5.0     mid-May      False      NaN

Note that the Feedback column did not take in our values. What happened? <br><br>
Well, our Series s and the DataFrame df use different indexes ([0,1] and [Store 1, Store 2, Store 3] respectively).

One solution would be resetting the index of our DataFrame via `reset_index`. This stores our current index as a column and defaults to the standart index. Now the index of our df and s are the same and we can re-insert the values.

In [243]:
df = df.reset_index() #reset index
df

     index       Name Item Purchased  Cost        Date  Delivered Feedback
0  Store 1   Matthias         Sponge  22.5  December 1       True      NaN
1  Store 1     Thomas   Kitty Litter   2.5   January 1       True      NaN
2  Store 2  Christina          Spoon   5.0     mid-May      False      NaN

In [244]:
df["Feedback"] = s # re-insert values
df

     index       Name Item Purchased  Cost        Date  Delivered  Feedback
0  Store 1   Matthias         Sponge  22.5  December 1       True  Positive
1  Store 1     Thomas   Kitty Litter   2.5   January 1       True  Negative
2  Store 2  Christina          Spoon   5.0     mid-May      False       NaN

### Changing the index

If we look at our column, we now have the problem that we have a useless "index" column. Is there a way to set this column back to be the "real" index?

Of course, just use `set_index(column name)`

In [245]:
df.set_index("index") # set index column to index again

              Name Item Purchased  Cost        Date  Delivered  Feedback
index
Store 1   Matthias         Sponge  22.5  December 1       True  Positive
Store 1     Thomas   Kitty Litter   2.5   January 1       True  Negative
Store 2  Christina          Spoon   5.0     mid-May      False       NaN

## Merging Dataframes

Let's see how we can combine several dataframes to one. Let's again start by defining some dummy dataframes.

In [252]:
# student DataFrame
student_df = pd.DataFrame([{'Name': 'Thomas', 'School': 'Computer Science'}, {'Name': 'Reto', 'School': 'Law'}, {'Name': 'Christina', 'School': 'Business'}])
student_df = student_df.set_index('Name')

student_df

                     School
Name
Thomas     Computer Science
Reto                    Law
Christina          Business

In [253]:
# staff DataFrame
staff_df = pd.DataFrame([{'Name': 'Myriam', 'Role': 'Director of HR'},
{'Name': 'Christina', 'Role': 'Course liasion'}, {'Name': 'Thomas', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')

staff_df

                     Role
Name
Myriam     Director of HR
Christina  Course liasion
Thomas             Grader

We can merge two dataframes with pandas' `merge()` function. The syntax looks like this.

**`pd.merge(left_df, right_df, how, left_index, right_index)`**

For the "how" parameter we must understand that four different ways of joining two dataframes exist. Let's have a look at all of them.


![In general, four different ways of joining to dataframes exist](https://media.geeksforgeeks.org/wp-content/uploads/joinimages.png)

### Merge Outer (Union)

In a full outer join, we We look at the keys from both DataFrames and create a new DataFrame with the
columns of each. The row values in the columns correspond to the values in the
original DataFrame.

In [255]:
pd.merge(student_df, staff_df, how='outer', left_index=True, right_index=True)

                     School            Role
Name
Christina          Business  Course liasion
Myriam                  NaN  Director of HR
Reto                    Law             NaN
Thomas     Computer Science          Grader

### Inner join (Intersection)

We look at the keys from both DataFrames and create a new DataFrame with only the
indices that appear in both DataFrames.

In [256]:
pd.merge(student_df, staff_df, how='inner', left_index=True, right_index=True)

                     School            Role
Name
Thomas     Computer Science          Grader
Christina          Business  Course liasion

### Left join

We look at the keys from both DataFrames and create a new DataFrame with only the
indices that appear in the left DataFrame.

In [258]:
pd.merge(student_df, staff_df, how='left', left_index=True, right_index=True)

                     School            Role
Name
Thomas     Computer Science          Grader
Reto                    Law             NaN
Christina          Business  Course liasion

### Right join

We look at the keys from both DataFrames and create a new DataFrame with only the indices that appear in the right DataFrame.

In [259]:
pd.merge(student_df, staff_df, how='right', left_index=True, right_index=True)

                     School            Role
Name
Myriam                  NaN  Director of HR
Christina          Business  Course liasion
Thomas     Computer Science          Grader

### Merging on Columns

So far, we have only merged the dataframes, according to row values. We can also specify columns according which the two dataframes should be merged. Here we use the `"left/right_on" `parameter.

In [262]:
pd.merge(staff_df, student_df, how='outer', left_on='Name', right_on='Name')

                     Role            School
Name
Myriam     Director of HR               NaN
Christina  Course liasion          Business
Thomas             Grader  Computer Science
Reto                  NaN               Law

### Merge conflict

Obviously, merging bigger dataframes can lead to problems. Let's look at the following example

In [263]:
student_df = pd.DataFrame([{'Name': 'Thomas', 'School': 'Computer Science', 'Location': 'Museumsstrasse'}, {'Name': 'Reto', 'School': 'Law', 'Location':'Poststrasse'},
                           {'Name': 'Christina', 'School': 'Business',
                            'Location': 'Spisergasse'}])

student_df

        Name            School        Location
0     Thomas  Computer Science  Museumsstrasse
1       Reto               Law     Poststrasse
2  Christina          Business     Spisergasse

In [265]:
staff_df = pd.DataFrame([{'Name': 'Myriam', 'Role': 'Director of HR', 'Location': 'Dufourstrasse'},
                         {'Name': 'Christina', 'Role': 'Course liasion', 'Location': 'MF Strasse'}, 
                         {'Name': 'Thomas', 'Role': 'Grader', 'Location': 'Rosenbergstrasse'}])

staff_df

        Name            Role          Location
0     Myriam  Director of HR     Dufourstrasse
1  Christina  Course liasion        MF Strasse
2     Thomas          Grader  Rosenbergstrasse

In [266]:
pd.merge(student_df, staff_df, how='outer', left_on='Name', right_on='Name')

        Name            School  ...            Role        Location_y
0     Thomas  Computer Science  ...          Grader  Rosenbergstrasse
1       Reto               Law  ...             NaN               NaN
2  Christina          Business  ...  Course liasion        MF Strasse
3     Myriam               NaN  ...  Director of HR     Dufourstrasse

[4 rows x 5 columns]

We can see that the mege function automatically created to columns for the Location. This is due to the fact that the location column in the staff_df specified the location of the office, whereas the location for the student_df stated their home adress. 

Therefore, there are two different values for the same column name, which resulted in the creation of two seperate columns (x being from left, y being from right dataframe).

### Joining over multiple columns

In [268]:
staff_df = pd.DataFrame([{'First Name': 'Myriam', 'Last Name': 'Schmuck', 'Role': 'Director of HR'}, 
                         {'First Name': 'Christina', 'Last Name': 'Zenker','Role': 'Course liasion'}, 
                         {'First Name': 'Thomas', 'Last Name': 'Huber', 'Role': 'Grader'}])

staff_df

  First Name Last Name            Role
0     Myriam   Schmuck  Director of HR
1  Christina    Zenker  Course liasion
2     Thomas     Huber          Grader

In [269]:
student_df = pd.DataFrame([{'First Name': 'Thomas', 'Last Name': 'Mayer','School': 'Business'},
                           {'First Name': 'Reto', 'Last Name': 'Schmied', 'School': 'Law'},
                           {'First Name': 'Christina', 'Last Name': 'Zenker', 'School': 'Business'}])

student_df

  First Name Last Name    School
0     Thomas     Mayer  Business
1       Reto   Schmied       Law
2  Christina    Zenker  Business

Often a single value is not enough to merge correctly. In this example there are two
rows with ”First Name”: ”Thomas”, but they are different people with different last
names. Merging on ”First Name” is not good enough here!

Therefore, we specify that we want to merge both on the First and Last Name Columns. As Christina Zenker is the only one that exists in both datasets (we want an intersection), she will be added to the new dataframe.

In [271]:
pd.merge(student_df, staff_df, how='inner', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name Last Name    School            Role
0  Christina    Zenker  Business  Course liasion

## Pandas `where`

.where() is a special function in the pandas library. It is used to check a data frame for one or more conditions and return the result accordingly. By default, the rows not satisfying the condition are filled with `NaN` value. 

Let's recall our boston housing dataset from the beginning.

In [274]:
boston.head(5)

         CRIM    ZN  INDUS  CHAS    NOX  ...  RAD    TAX  PTRATIO       B  LSTAT
MEDV                                     ...
24.0  0.00632  18.0   2.31   0.0  0.538  ...  1.0  296.0     15.3  396.90   4.98
21.6  0.02731   0.0   7.07   0.0  0.469  ...  2.0  242.0     17.8  396.90   9.14
34.7  0.02729   0.0   7.07   0.0  0.469  ...  2.0  242.0     17.8  392.83   4.03
33.4  0.03237   0.0   2.18   0.0  0.458  ...  3.0  222.0     18.7  394.63   2.94
36.2  0.06905   0.0   2.18   0.0  0.458  ...  3.0  222.0     18.7  396.90   5.33

[5 rows x 13 columns]

In [277]:
boston_dataset.DESCR

".. _boston_dataset:\n\nBoston house prices dataset\n---------------------------\n\n**Data Set Characteristics:**  \n\n    :Number of Instances: 506 \n\n    :Number of Attributes: 13 numeric/categorical predictive. Median Value (attribute 14) is usually the target.\n\n    :Attribute Information (in order):\n        - CRIM     per capita crime rate by town\n        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.\n        - INDUS    proportion of non-retail business acres per town\n        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)\n        - NOX      nitric oxides concentration (parts per 10 million)\n        - RM       average number of rooms per dwelling\n        - AGE      proportion of owner-occupied units built prior to 1940\n        - DIS      weighted distances to five Boston employment centres\n        - RAD      index of accessibility to radial highways\n        - TAX      full-value property-tax rate per $10,000\n        - PTRATIO  pupil-teacher ratio by town\n        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town\n        - LSTAT    % lower status of the population\n        - MEDV     Median value of owner-occupied homes in $1000's\n\n    :Missing Attribute Values: None\n\n    :Creator: Harrison, D. and Rubinfeld, D.L.\n\nThis is a copy of UCI ML housing dataset.\nhttps://archive.ics.uci.edu/ml/machine-learning-databases/housing/\n\n\nThis dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.\n\nThe Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic\nprices and the demand for clean air', J. Environ. Economics & Management,\nvol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics\n...', Wiley, 1980.   N.B. Various transformations are used in the table on\npages 244-261 of the latter.\n\nThe Boston house-price data has been used in many machine learning papers that address regression\nproblems.   \n     \n.. topic:: References\n\n   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.\n   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.\n"

Let's look up all the rows, whose average number of rooms (= RM) is below 7. You can see that those rows with RM > 7 are automatically filled with NaN values.

In [286]:
boston.where(boston["RM"]<7)

         CRIM    ZN  INDUS  CHAS    NOX  ...  RAD    TAX  PTRATIO       B  LSTAT
MEDV                                     ...
24.0  0.00632  18.0   2.31   0.0  0.538  ...  1.0  296.0     15.3  396.90   4.98
21.6  0.02731   0.0   7.07   0.0  0.469  ...  2.0  242.0     17.8  396.90   9.14
34.7  0.02729   0.0   7.07   0.0  0.469  ...  2.0  242.0     17.8  392.83   4.03
33.4  0.03237   0.0   2.18   0.0  0.458  ...  3.0  222.0     18.7  394.63   2.94
36.2  0.06905   0.0   2.18   0.0  0.458  ...  3.0  222.0     18.7  396.90   5.33
...       ...   ...    ...   ...    ...  ...  ...    ...      ...     ...    ...
22.4  0.06263   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  391.99   9.67
20.6  0.04527   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   9.08
23.9  0.06076   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   5.64
22.0  0.10959   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  393.45   6.48
11.9  0.04741   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   7.88

[506 rows x 13 columns]

Now we can also drop all rows that with nan values (that is rows with RM > 7) by:

In [288]:
boston.where(boston["RM"]<7).dropna() # we got rid of 506 - 442 = 64 rows

         CRIM    ZN  INDUS  CHAS    NOX  ...  RAD    TAX  PTRATIO       B  LSTAT
MEDV                                     ...
24.0  0.00632  18.0   2.31   0.0  0.538  ...  1.0  296.0     15.3  396.90   4.98
21.6  0.02731   0.0   7.07   0.0  0.469  ...  2.0  242.0     17.8  396.90   9.14
33.4  0.03237   0.0   2.18   0.0  0.458  ...  3.0  222.0     18.7  394.63   2.94
28.7  0.02985   0.0   2.18   0.0  0.458  ...  3.0  222.0     18.7  394.12   5.21
22.9  0.08829  12.5   7.87   0.0  0.524  ...  5.0  311.0     15.2  395.60  12.43
...       ...   ...    ...   ...    ...  ...  ...    ...      ...     ...    ...
22.4  0.06263   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  391.99   9.67
20.6  0.04527   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   9.08
23.9  0.06076   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   5.64
22.0  0.10959   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  393.45   6.48
11.9  0.04741   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   7.88

[442 rows x 13 columns]

Now after dropping these rows, we want to rename the RM column to "rooms_average". This can be done as follows.

In [301]:
boston.where(boston["RM"]<7).dropna().rename(columns={"RM":"rooms_average"})

         CRIM    ZN  INDUS  CHAS    NOX  ...  RAD    TAX  PTRATIO       B  LSTAT
MEDV                                     ...
24.0  0.00632  18.0   2.31   0.0  0.538  ...  1.0  296.0     15.3  396.90   4.98
21.6  0.02731   0.0   7.07   0.0  0.469  ...  2.0  242.0     17.8  396.90   9.14
33.4  0.03237   0.0   2.18   0.0  0.458  ...  3.0  222.0     18.7  394.63   2.94
28.7  0.02985   0.0   2.18   0.0  0.458  ...  3.0  222.0     18.7  394.12   5.21
22.9  0.08829  12.5   7.87   0.0  0.524  ...  5.0  311.0     15.2  395.60  12.43
...       ...   ...    ...   ...    ...  ...  ...    ...      ...     ...    ...
22.4  0.06263   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  391.99   9.67
20.6  0.04527   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   9.08
23.9  0.06076   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   5.64
22.0  0.10959   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  393.45   6.48
11.9  0.04741   0.0  11.93   0.0  0.573  ...  1.0  273.0     21.0  396.90   7.88

[442 rows x 13 columns]

With this example we can see how further actions can follow the where() function.

## Pandas `groupby`

Groupby enables us to group rows with shared values together. A groupby operation involves some combination of splitting the
object, applying a function, and combining the results. This can be
used to group large amounts of data and compute operations on these
groups

Let's take another example:

In [307]:
df = pd.DataFrame({
    'user_id':[1,2,1,3,3,],
    'content_id':[1,1,2,2,2],
    'tag':['cool','nice','clever','clever','not-bad']
})

df

   user_id  content_id      tag
0        1           1     cool
1        2           1     nice
2        1           2   clever
3        3           2   clever
4        3           2  not-bad

In [308]:
df.groupby("content_id")['tag'].apply(lambda tags: ','.join(tags))

content_id
1                cool,nice
2    clever,clever,not-bad
Name: tag, dtype: object

In [312]:
df.groupby("content_id")["user_id"].nunique().to_frame()

            user_id
content_id
1                 2
2                 2

### Pandas `.agg`